// Задание 1

// Ко всем элементам, имеющим класс "dropdown-item" добавить еще один класс
// "super-dropdown", необходимо использовать методы forEach и querySelectorAll
// и свойство classList у элементов.

// --------------------------------------------------------------------
console.log("--------------------------------------------------------------------");
console.log("Задание 1");
console.log("--------------------------------------------------------------------");
// --------------------------------------------------------------------
// Задание 2

// У элемента с классом btn необходимо убрать класс "btn-secondary", если он
// присутствует у этого элемента, либо добавить, если такого класса у элемента не было.

// --------------------------------------------------------------------
console.log("--------------------------------------------------------------------");
console.log("Задание 2");
console.log("--------------------------------------------------------------------");

// --------------------------------------------------------------------
// Задание 3

// Необходимо удалить класс "dropdown-menu" у элемента, у которого присутствует
// класс "menu".

// --------------------------------------------------------------------
console.log("--------------------------------------------------------------------");
console.log("Задание 3");
console.log("--------------------------------------------------------------------");

// --------------------------------------------------------------------
// Задание 4

// Используя метод insertAdjacentHTML добавьте после div a с классом "dropdown"
// следующую разметку: <a href="#">link</a>

// --------------------------------------------------------------------
console.log("--------------------------------------------------------------------");
console.log("Задание 4");
console.log("--------------------------------------------------------------------");

// --------------------------------------------------------------------
// Задание 5

// У элемента с id "dropdownMenuButton" замените id на "superDropdown".

// --------------------------------------------------------------------
console.log("--------------------------------------------------------------------");
console.log("Задание 5");
console.log("--------------------------------------------------------------------");

// --------------------------------------------------------------------
// Задание 6

// Добавьте атрибут data-dd со значением 3 элементу у которого существует атрибут
// "aria-labelledby" равный "dropdownMenuButton" используя dataset.

// --------------------------------------------------------------------
console.log("--------------------------------------------------------------------");
console.log("Задание 6");
console.log("--------------------------------------------------------------------");

// --------------------------------------------------------------------
// Задание 7

// Удалите атрибут type у элемента с классом "dropdown-toggle".

// --------------------------------------------------------------------
console.log("--------------------------------------------------------------------");
console.log("Задание 7");
console.log("--------------------------------------------------------------------");
// --------------------------------------------------------------------
